SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_modem.h
/* Bit fields for MODEM ANARAMPCTRL */
#define _MODEM_ANARAMPCTRL_RESETVALUE                           0x00000A00UL                                  /**< Default value for MODEM_ANARAMPCTRL         */
#define _MODEM_ANARAMPCTRL_MASK                                 0x00001E06UL                                  /**< Mask for MODEM_ANARAMPCTRL                  */
#define MODEM_ANARAMPCTRL_RAMPOVREN                             (0x1UL << 1)                                  /**< PA Analog Ramp Override                     */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_SHIFT                      1                                             /**< Shift value for MODEM_RAMPOVREN             */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_MASK                       0x2UL                                         /**< Bit mask for MODEM_RAMPOVREN                */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT                     (_MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT << 1)   /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_RAMPOVRUPD                            (0x1UL << 2)                                  /**< PA Analog Ramp Override Update Pulse        */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_SHIFT                     2                                             /**< Shift value for MODEM_RAMPOVRUPD            */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_MASK                      0x4UL                                         /**< Bit mask for MODEM_RAMPOVRUPD               */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT                    (_MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT << 2)  /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_SHIFT                       9                                             /**< Shift value for MODEM_VMIDCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_MASK                        0x600UL                                       /**< Bit mask for MODEM_VMIDCTRL                 */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT                     0x00000001UL                                  /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_OFF                         0x00000000UL                                  /**< Mode OFF for MODEM_ANARAMPCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_MID                         0x00000001UL                                  /**< Mode MID for MODEM_ANARAMPCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_HIGH                        0x00000002UL                                  /**< Mode HIGH for MODEM_ANARAMPCTRL             */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_ON                          0x00000003UL                                  /**< Mode ON for MODEM_ANARAMPCTRL               */
#define MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT                      (_MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT << 9)    /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_VMIDCTRL_OFF                          (_MODEM_ANARAMPCTRL_VMIDCTRL_OFF << 9)        /**< Shifted mode OFF for MODEM_ANARAMPCTRL      */
#define MODEM_ANARAMPCTRL_VMIDCTRL_MID                          (_MODEM_ANARAMPCTRL_VMIDCTRL_MID << 9)        /**< Shifted mode MID for MODEM_ANARAMPCTRL      */
#define MODEM_ANARAMPCTRL_VMIDCTRL_HIGH                         (_MODEM_ANARAMPCTRL_VMIDCTRL_HIGH << 9)       /**< Shifted mode HIGH for MODEM_ANARAMPCTRL     */
#define MODEM_ANARAMPCTRL_VMIDCTRL_ON                           (_MODEM_ANARAMPCTRL_VMIDCTRL_ON << 9)         /**< Shifted mode ON for MODEM_ANARAMPCTRL       */
#define _MODEM_ANARAMPCTRL_MUTEDLY_SHIFT                        11                                            /**< Shift value for MODEM_MUTEDLY               */
#define _MODEM_ANARAMPCTRL_MUTEDLY_MASK                         0x1800UL                                      /**< Bit mask for MODEM_MUTEDLY                  */
#define _MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT                      0x00000001UL                                  /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0US                      0x00000000UL                                  /**< Mode TIME0US for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US                    0x00000001UL                                  /**< Mode TIME0P5US for MODEM_ANARAMPCTRL        */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US                   0x00000002UL                                  /**< Mode TIME0P25US for MODEM_ANARAMPCTRL       */
#define _MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED                      0x00000003UL                                  /**< Mode NOTUSED for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT                       (_MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT << 11)    /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0US                       (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0US << 11)    /**< Shifted mode TIME0US for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US                     (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US << 11)  /**< Shifted mode TIME0P5US for MODEM_ANARAMPCTRL*/
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US                    (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US << 11) /**< Shifted mode TIME0P25US for MODEM_ANARAMPCTRL*/
#define MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED                       (_MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED << 11)    /**< Shifted mode NOTUSED for MODEM_ANARAMPCTRL  */

/* Bit fields for MODEM DCCOMP */
#define _MODEM_DCCOMP_RESETVALUE                                0x00000030UL                                 /**< Default value for MODEM_DCCOMP              */
#define _MODEM_DCCOMP_MASK                                      0x001FFFFFUL                                 /**< Mask for MODEM_DCCOMP                       */
#define MODEM_DCCOMP_DCESTIEN                                   (0x1UL << 0)                                 /**< DC Offset Estimation Enable                 */
#define _MODEM_DCCOMP_DCESTIEN_SHIFT                            0                                            /**< Shift value for MODEM_DCESTIEN              */
#define _MODEM_DCCOMP_DCESTIEN_MASK                             0x1UL                                        /**< Bit mask for MODEM_DCESTIEN                 */
#define _MODEM_DCCOMP_DCESTIEN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCESTIEN_DEFAULT                           (_MODEM_DCCOMP_DCESTIEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCCOMPEN                                   (0x1UL << 1)                                 /**< DC Offset Compensation Enable               */
#define _MODEM_DCCOMP_DCCOMPEN_SHIFT                            1                                            /**< Shift value for MODEM_DCCOMPEN              */
#define _MODEM_DCCOMP_DCCOMPEN_MASK                             0x2UL                                        /**< Bit mask for MODEM_DCCOMPEN                 */
#define _MODEM_DCCOMP_DCCOMPEN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPEN_DEFAULT                           (_MODEM_DCCOMP_DCCOMPEN_DEFAULT << 1)        /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCRSTEN                                    (0x1UL << 2)                                 /**< DC Compensation Filter Reset Enable         */
#define _MODEM_DCCOMP_DCRSTEN_SHIFT                             2                                            /**< Shift value for MODEM_DCRSTEN               */
#define _MODEM_DCCOMP_DCRSTEN_MASK                              0x4UL                                        /**< Bit mask for MODEM_DCRSTEN                  */
#define _MODEM_DCCOMP_DCRSTEN_DEFAULT                           0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCRSTEN_DEFAULT                            (_MODEM_DCCOMP_DCRSTEN_DEFAULT << 2)         /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCCOMPFREEZE                               (0x1UL << 3)                                 /**< DC Offset Compensation Filter Freeze        */
#define _MODEM_DCCOMP_DCCOMPFREEZE_SHIFT                        3                                            /**< Shift value for MODEM_DCCOMPFREEZE          */
#define _MODEM_DCCOMP_DCCOMPFREEZE_MASK                         0x8UL                                        /**< Bit mask for MODEM_DCCOMPFREEZE             */
#define _MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT                       (_MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT << 3)    /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCCOMPGEAR_SHIFT                          4                                            /**< Shift value for MODEM_DCCOMPGEAR            */
#define _MODEM_DCCOMP_DCCOMPGEAR_MASK                           0x70UL                                       /**< Bit mask for MODEM_DCCOMPGEAR               */
#define _MODEM_DCCOMP_DCCOMPGEAR_DEFAULT                        0x00000003UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPGEAR_DEFAULT                         (_MODEM_DCCOMP_DCCOMPGEAR_DEFAULT << 4)      /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCLIMIT_SHIFT                             7                                            /**< Shift value for MODEM_DCLIMIT               */
#define _MODEM_DCCOMP_DCLIMIT_MASK                              0x180UL                                      /**< Bit mask for MODEM_DCLIMIT                  */
#define _MODEM_DCCOMP_DCLIMIT_DEFAULT                           0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALE                         0x00000000UL                                 /**< Mode FULLSCALE for MODEM_DCCOMP             */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4                      0x00000001UL                                 /**< Mode FULLSCALEBY4 for MODEM_DCCOMP          */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8                      0x00000002UL                                 /**< Mode FULLSCALEBY8 for MODEM_DCCOMP          */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16                     0x00000003UL                                 /**< Mode FULLSCALEBY16 for MODEM_DCCOMP         */
#define MODEM_DCCOMP_DCLIMIT_DEFAULT                            (_MODEM_DCCOMP_DCLIMIT_DEFAULT << 7)         /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALE                          (_MODEM_DCCOMP_DCLIMIT_FULLSCALE << 7)       /**< Shifted mode FULLSCALE for MODEM_DCCOMP     */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4                       (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4 << 7)    /**< Shifted mode FULLSCALEBY4 for MODEM_DCCOMP  */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8                       (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8 << 7)    /**< Shifted mode FULLSCALEBY8 for MODEM_DCCOMP  */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16                      (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16 << 7)   /**< Shifted mode FULLSCALEBY16 for MODEM_DCCOMP */
#define MODEM_DCCOMP_DCGAINGEAREN                               (0x1UL << 9)                                 /**< DC Offset Gain Change Filter Gear Enable    */
#define _MODEM_DCCOMP_DCGAINGEAREN_SHIFT                        9                                            /**< Shift value for MODEM_DCGAINGEAREN          */
#define _MODEM_DCCOMP_DCGAINGEAREN_MASK                         0x200UL                                      /**< Bit mask for MODEM_DCGAINGEAREN             */
#define _MODEM_DCCOMP_DCGAINGEAREN_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEAREN_DEFAULT                       (_MODEM_DCCOMP_DCGAINGEAREN_DEFAULT << 9)    /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCGAINGEAR_SHIFT                          10                                           /**< Shift value for MODEM_DCGAINGEAR            */
#define _MODEM_DCCOMP_DCGAINGEAR_MASK                           0x1C00UL                                     /**< Bit mask for MODEM_DCGAINGEAR               */
#define _MODEM_DCCOMP_DCGAINGEAR_DEFAULT                        0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEAR_DEFAULT                         (_MODEM_DCCOMP_DCGAINGEAR_DEFAULT << 10)     /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_SHIFT                      13                                           /**< Shift value for MODEM_DCGAINGEARSMPS        */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_MASK                       0x1FE000UL                                   /**< Bit mask for MODEM_DCGAINGEARSMPS           */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT                     (_MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT << 13) /**< Shifted mode DEFAULT for MODEM_DCCOMP       */

/* Bit fields for MODEM DCCOMPFILTINIT */
#define _MODEM_DCCOMPFILTINIT_RESETVALUE                        0x00000000UL                                         /**< Default value for MODEM_DCCOMPFILTINIT      */
#define _MODEM_DCCOMPFILTINIT_MASK                              0x7FFFFFFFUL                                         /**< Mask for MODEM_DCCOMPFILTINIT               */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_SHIFT              0                                                    /**< Shift value for MODEM_DCCOMPINITVALI        */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_MASK               0x7FFFUL                                             /**< Bit mask for MODEM_DCCOMPINITVALI           */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT            0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT             (_MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_SHIFT              15                                                   /**< Shift value for MODEM_DCCOMPINITVALQ        */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_MASK               0x3FFF8000UL                                         /**< Bit mask for MODEM_DCCOMPINITVALQ           */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT            0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT             (_MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT                         (0x1UL << 30)                                        /**< Initialize filter state                     */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_SHIFT                  30                                                   /**< Shift value for MODEM_DCCOMPINIT            */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_MASK                   0x40000000UL                                         /**< Bit mask for MODEM_DCCOMPINIT               */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT                0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT                 (_MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT << 30)     /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/

/* Bit fields for MODEM DCESTI */
#define _MODEM_DCESTI_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_DCESTI              */
#define _MODEM_DCESTI_MASK                                      0x3FFFFFFFUL                                 /**< Mask for MODEM_DCESTI                       */
#define _MODEM_DCESTI_DCCOMPESTIVALI_SHIFT                      0                                            /**< Shift value for MODEM_DCCOMPESTIVALI        */
#define _MODEM_DCESTI_DCCOMPESTIVALI_MASK                       0x7FFFUL                                     /**< Bit mask for MODEM_DCCOMPESTIVALI           */
#define _MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCESTI               */
#define MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT                     (_MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_DCESTI       */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_SHIFT                      15                                           /**< Shift value for MODEM_DCCOMPESTIVALQ        */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_MASK                       0x3FFF8000UL                                 /**< Bit mask for MODEM_DCCOMPESTIVALQ           */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCESTI               */
#define MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT                     (_MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_DCESTI       */

