SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_modem.h
/* Bit fields for MODEM TRECSCFG */
#define _MODEM_TRECSCFG_RESETVALUE                              0x00020004UL                               /**< Default value for MODEM_TRECSCFG            */
#define _MODEM_TRECSCFG_MASK                                    0x01FF5FFFUL                               /**< Mask for MODEM_TRECSCFG                     */
#define _MODEM_TRECSCFG_TRECSOSR_SHIFT                          0                                          /**< Shift value for MODEM_TRECSOSR              */
#define _MODEM_TRECSCFG_TRECSOSR_MASK                           0x7UL                                      /**< Bit mask for MODEM_TRECSOSR                 */
#define _MODEM_TRECSCFG_TRECSOSR_DEFAULT                        0x00000004UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_TRECSOSR_DEFAULT                         (_MODEM_TRECSCFG_TRECSOSR_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_SHIFT                       3                                          /**< Shift value for MODEM_DTIMLOSSTHD           */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_MASK                        0x1FF8UL                                   /**< Bit mask for MODEM_DTIMLOSSTHD              */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT                      (_MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT << 3) /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define MODEM_TRECSCFG_DTIMLOSSEN                               (0x1UL << 14)                              /**< ENABLE TIMING LOSS DETECTION                */
#define _MODEM_TRECSCFG_DTIMLOSSEN_SHIFT                        14                                         /**< Shift value for MODEM_DTIMLOSSEN            */
#define _MODEM_TRECSCFG_DTIMLOSSEN_MASK                         0x4000UL                                   /**< Bit mask for MODEM_DTIMLOSSEN               */
#define _MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT                       (_MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define _MODEM_TRECSCFG_PMOFFSET_SHIFT                          16                                         /**< Shift value for MODEM_PMOFFSET              */
#define _MODEM_TRECSCFG_PMOFFSET_MASK                           0x1FF0000UL                                /**< Bit mask for MODEM_PMOFFSET                 */
#define _MODEM_TRECSCFG_PMOFFSET_DEFAULT                        0x00000002UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_PMOFFSET_DEFAULT                         (_MODEM_TRECSCFG_PMOFFSET_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */

/* Bit fields for MODEM CFGANTPATT */
#define _MODEM_CFGANTPATT_RESETVALUE                            0x00000000UL                                   /**< Default value for MODEM_CFGANTPATT          */
#define _MODEM_CFGANTPATT_MASK                                  0x3FFFFFFFUL                                   /**< Mask for MODEM_CFGANTPATT                   */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_SHIFT                   0                                              /**< Shift value for MODEM_CFGANTPATTVAL         */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_MASK                    0x3FFFFFFFUL                                   /**< Bit mask for MODEM_CFGANTPATTVAL            */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_CFGANTPATT           */
#define MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT                  (_MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CFGANTPATT   */

/* Bit fields for MODEM COCURRMODE */
#define _MODEM_COCURRMODE_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_COCURRMODE          */
#define _MODEM_COCURRMODE_MASK                                  0x80000000UL                                 /**< Mask for MODEM_COCURRMODE                   */
#define MODEM_COCURRMODE_CONCURRENT                             (0x1UL << 31)                                /**< CONCURRENT MODE Enable                      */
#define _MODEM_COCURRMODE_CONCURRENT_SHIFT                      31                                           /**< Shift value for MODEM_CONCURRENT            */
#define _MODEM_COCURRMODE_CONCURRENT_MASK                       0x80000000UL                                 /**< Bit mask for MODEM_CONCURRENT               */
#define _MODEM_COCURRMODE_CONCURRENT_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_COCURRMODE           */
#define MODEM_COCURRMODE_CONCURRENT_DEFAULT                     (_MODEM_COCURRMODE_CONCURRENT_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_COCURRMODE   */

/* Bit fields for MODEM CHFCOE00 */
#define _MODEM_CHFCOE00_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE00            */
#define _MODEM_CHFCOE00_MASK                                    0x3FFFFFFFUL                               /**< Mask for MODEM_CHFCOE00                     */
#define _MODEM_CHFCOE00_SET0COEFF0_SHIFT                        0                                          /**< Shift value for MODEM_SET0COEFF0            */
#define _MODEM_CHFCOE00_SET0COEFF0_MASK                         0x3FFUL                                    /**< Bit mask for MODEM_SET0COEFF0               */
#define _MODEM_CHFCOE00_SET0COEFF0_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE00             */
#define MODEM_CHFCOE00_SET0COEFF0_DEFAULT                       (_MODEM_CHFCOE00_SET0COEFF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE00     */
#define _MODEM_CHFCOE00_SET0COEFF1_SHIFT                        10                                         /**< Shift value for MODEM_SET0COEFF1            */
#define _MODEM_CHFCOE00_SET0COEFF1_MASK                         0xFFC00UL                                  /**< Bit mask for MODEM_SET0COEFF1               */
#define _MODEM_CHFCOE00_SET0COEFF1_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE00             */
#define MODEM_CHFCOE00_SET0COEFF1_DEFAULT                       (_MODEM_CHFCOE00_SET0COEFF1_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_CHFCOE00     */
#define _MODEM_CHFCOE00_SET0COEFF2_SHIFT                        20                                         /**< Shift value for MODEM_SET0COEFF2            */
#define _MODEM_CHFCOE00_SET0COEFF2_MASK                         0x3FF00000UL                               /**< Bit mask for MODEM_SET0COEFF2               */
#define _MODEM_CHFCOE00_SET0COEFF2_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE00             */
#define MODEM_CHFCOE00_SET0COEFF2_DEFAULT                       (_MODEM_CHFCOE00_SET0COEFF2_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_CHFCOE00     */

