SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_modem.h
/* Bit fields for MODEM HADMCTRL0 */
#define _MODEM_HADMCTRL0_RESETVALUE                             0x00000000UL                                     /**< Default value for MODEM_HADMCTRL0           */
#define _MODEM_HADMCTRL0_MASK                                   0xFC00703FUL                                     /**< Mask for MODEM_HADMCTRL0                    */
#define MODEM_HADMCTRL0_HADMEN                                  (0x1UL << 0)                                     /**< Enable HADM                                 */
#define _MODEM_HADMCTRL0_HADMEN_SHIFT                           0                                                /**< Shift value for MODEM_HADMEN                */
#define _MODEM_HADMCTRL0_HADMEN_MASK                            0x1UL                                            /**< Bit mask for MODEM_HADMEN                   */
#define _MODEM_HADMCTRL0_HADMEN_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_HADMEN_DEFAULT                          (_MODEM_HADMCTRL0_HADMEN_DEFAULT << 0)           /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_TESEN                                   (0x1UL << 1)                                     /**< Tone Exchange Step Enable                   */
#define _MODEM_HADMCTRL0_TESEN_SHIFT                            1                                                /**< Shift value for MODEM_TESEN                 */
#define _MODEM_HADMCTRL0_TESEN_MASK                             0x2UL                                            /**< Bit mask for MODEM_TESEN                    */
#define _MODEM_HADMCTRL0_TESEN_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_TESEN_DEFAULT                           (_MODEM_HADMCTRL0_TESEN_DEFAULT << 1)            /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_PESEN                                   (0x1UL << 2)                                     /**< Packet Exchange Step Enable                 */
#define _MODEM_HADMCTRL0_PESEN_SHIFT                            2                                                /**< Shift value for MODEM_PESEN                 */
#define _MODEM_HADMCTRL0_PESEN_MASK                             0x4UL                                            /**< Bit mask for MODEM_PESEN                    */
#define _MODEM_HADMCTRL0_PESEN_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_PESEN_DEFAULT                           (_MODEM_HADMCTRL0_PESEN_DEFAULT << 2)            /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_SNDSEQEN                                (0x1UL << 3)                                     /**< Sounding Sequence Enable                    */
#define _MODEM_HADMCTRL0_SNDSEQEN_SHIFT                         3                                                /**< Shift value for MODEM_SNDSEQEN              */
#define _MODEM_HADMCTRL0_SNDSEQEN_MASK                          0x8UL                                            /**< Bit mask for MODEM_SNDSEQEN                 */
#define _MODEM_HADMCTRL0_SNDSEQEN_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_SNDSEQEN_DEFAULT                        (_MODEM_HADMCTRL0_SNDSEQEN_DEFAULT << 3)         /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_ROLE                                    (0x1UL << 4)                                     /**< HADM Role                                   */
#define _MODEM_HADMCTRL0_ROLE_SHIFT                             4                                                /**< Shift value for MODEM_ROLE                  */
#define _MODEM_HADMCTRL0_ROLE_MASK                              0x10UL                                           /**< Bit mask for MODEM_ROLE                     */
#define _MODEM_HADMCTRL0_ROLE_DEFAULT                           0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define _MODEM_HADMCTRL0_ROLE_INITIATOR                         0x00000000UL                                     /**< Mode INITIATOR for MODEM_HADMCTRL0          */
#define _MODEM_HADMCTRL0_ROLE_REFLECTOR                         0x00000001UL                                     /**< Mode REFLECTOR for MODEM_HADMCTRL0          */
#define MODEM_HADMCTRL0_ROLE_DEFAULT                            (_MODEM_HADMCTRL0_ROLE_DEFAULT << 4)             /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_ROLE_INITIATOR                          (_MODEM_HADMCTRL0_ROLE_INITIATOR << 4)           /**< Shifted mode INITIATOR for MODEM_HADMCTRL0  */
#define MODEM_HADMCTRL0_ROLE_REFLECTOR                          (_MODEM_HADMCTRL0_ROLE_REFLECTOR << 4)           /**< Shifted mode REFLECTOR for MODEM_HADMCTRL0  */
#define MODEM_HADMCTRL0_RTTPHY                                  (0x1UL << 5)                                     /**< PHY Used for RTT Packets                    */
#define _MODEM_HADMCTRL0_RTTPHY_SHIFT                           5                                                /**< Shift value for MODEM_RTTPHY                */
#define _MODEM_HADMCTRL0_RTTPHY_MASK                            0x20UL                                           /**< Bit mask for MODEM_RTTPHY                   */
#define _MODEM_HADMCTRL0_RTTPHY_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_RTTPHY_DEFAULT                          (_MODEM_HADMCTRL0_RTTPHY_DEFAULT << 5)           /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define _MODEM_HADMCTRL0_PM_SHIFT                               12                                               /**< Shift value for MODEM_PM                    */
#define _MODEM_HADMCTRL0_PM_MASK                                0x3000UL                                         /**< Bit mask for MODEM_PM                       */
#define _MODEM_HADMCTRL0_PM_DEFAULT                             0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_PM_DEFAULT                              (_MODEM_HADMCTRL0_PM_DEFAULT << 12)              /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_AVGMODE                                 (0x1UL << 14)                                    /**< Averaging Mode                              */
#define _MODEM_HADMCTRL0_AVGMODE_SHIFT                          14                                               /**< Shift value for MODEM_AVGMODE               */
#define _MODEM_HADMCTRL0_AVGMODE_MASK                           0x4000UL                                         /**< Bit mask for MODEM_AVGMODE                  */
#define _MODEM_HADMCTRL0_AVGMODE_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define _MODEM_HADMCTRL0_AVGMODE_PHASEAMP                       0x00000000UL                                     /**< Mode PHASEAMP for MODEM_HADMCTRL0           */
#define _MODEM_HADMCTRL0_AVGMODE_IQ                             0x00000001UL                                     /**< Mode IQ for MODEM_HADMCTRL0                 */
#define MODEM_HADMCTRL0_AVGMODE_DEFAULT                         (_MODEM_HADMCTRL0_AVGMODE_DEFAULT << 14)         /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_AVGMODE_PHASEAMP                        (_MODEM_HADMCTRL0_AVGMODE_PHASEAMP << 14)        /**< Shifted mode PHASEAMP for MODEM_HADMCTRL0   */
#define MODEM_HADMCTRL0_AVGMODE_IQ                              (_MODEM_HADMCTRL0_AVGMODE_IQ << 14)              /**< Shifted mode IQ for MODEM_HADMCTRL0         */
#define _MODEM_HADMCTRL0_DFTSCALE_SHIFT                         26                                               /**< Shift value for MODEM_DFTSCALE              */
#define _MODEM_HADMCTRL0_DFTSCALE_MASK                          0xC000000UL                                      /**< Bit mask for MODEM_DFTSCALE                 */
#define _MODEM_HADMCTRL0_DFTSCALE_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_DFTSCALE_DEFAULT                        (_MODEM_HADMCTRL0_DFTSCALE_DEFAULT << 26)        /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_PKTSENTSEL                              (0x1UL << 28)                                    /**< RTT Packet Sent Selection                   */
#define _MODEM_HADMCTRL0_PKTSENTSEL_SHIFT                       28                                               /**< Shift value for MODEM_PKTSENTSEL            */
#define _MODEM_HADMCTRL0_PKTSENTSEL_MASK                        0x10000000UL                                     /**< Bit mask for MODEM_PKTSENTSEL               */
#define _MODEM_HADMCTRL0_PKTSENTSEL_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define _MODEM_HADMCTRL0_PKTSENTSEL_BAUD_PRESENT                0x00000000UL                                     /**< Mode BAUD_PRESENT for MODEM_HADMCTRL0       */
#define _MODEM_HADMCTRL0_PKTSENTSEL_MOD_PRESENT                 0x00000001UL                                     /**< Mode MOD_PRESENT for MODEM_HADMCTRL0        */
#define MODEM_HADMCTRL0_PKTSENTSEL_DEFAULT                      (_MODEM_HADMCTRL0_PKTSENTSEL_DEFAULT << 28)      /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_PKTSENTSEL_BAUD_PRESENT                 (_MODEM_HADMCTRL0_PKTSENTSEL_BAUD_PRESENT << 28) /**< Shifted mode BAUD_PRESENT for MODEM_HADMCTRL0*/
#define MODEM_HADMCTRL0_PKTSENTSEL_MOD_PRESENT                  (_MODEM_HADMCTRL0_PKTSENTSEL_MOD_PRESENT << 28)  /**< Shifted mode MOD_PRESENT for MODEM_HADMCTRL0*/
#define MODEM_HADMCTRL0_TXUPSAMPOSR4                            (0x1UL << 29)                                    /**< TX symbol UP Sampling by 4                  */
#define _MODEM_HADMCTRL0_TXUPSAMPOSR4_SHIFT                     29                                               /**< Shift value for MODEM_TXUPSAMPOSR4          */
#define _MODEM_HADMCTRL0_TXUPSAMPOSR4_MASK                      0x20000000UL                                     /**< Bit mask for MODEM_TXUPSAMPOSR4             */
#define _MODEM_HADMCTRL0_TXUPSAMPOSR4_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_TXUPSAMPOSR4_DEFAULT                    (_MODEM_HADMCTRL0_TXUPSAMPOSR4_DEFAULT << 29)    /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_SSAFCGEAR                               (0x1UL << 30)                                    /**< SS AFC Gear SW                              */
#define _MODEM_HADMCTRL0_SSAFCGEAR_SHIFT                        30                                               /**< Shift value for MODEM_SSAFCGEAR             */
#define _MODEM_HADMCTRL0_SSAFCGEAR_MASK                         0x40000000UL                                     /**< Bit mask for MODEM_SSAFCGEAR                */
#define _MODEM_HADMCTRL0_SSAFCGEAR_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_SSAFCGEAR_DEFAULT                       (_MODEM_HADMCTRL0_SSAFCGEAR_DEFAULT << 30)       /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */
#define MODEM_HADMCTRL0_SRC2AUTOSCALE                           (0x1UL << 31)                                    /**< SRC2 Autoscaling Debug Output               */
#define _MODEM_HADMCTRL0_SRC2AUTOSCALE_SHIFT                    31                                               /**< Shift value for MODEM_SRC2AUTOSCALE         */
#define _MODEM_HADMCTRL0_SRC2AUTOSCALE_MASK                     0x80000000UL                                     /**< Bit mask for MODEM_SRC2AUTOSCALE            */
#define _MODEM_HADMCTRL0_SRC2AUTOSCALE_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for MODEM_HADMCTRL0            */
#define MODEM_HADMCTRL0_SRC2AUTOSCALE_DEFAULT                   (_MODEM_HADMCTRL0_SRC2AUTOSCALE_DEFAULT << 31)   /**< Shifted mode DEFAULT for MODEM_HADMCTRL0    */

/* Bit fields for MODEM HADMCTRL1 */
#define _MODEM_HADMCTRL1_RESETVALUE                             0x00040000UL                                            /**< Default value for MODEM_HADMCTRL1           */
#define _MODEM_HADMCTRL1_MASK                                   0xFFC7FF07UL                                            /**< Mask for MODEM_HADMCTRL1                    */
#define _MODEM_HADMCTRL1_STEPSTATE_SHIFT                        0                                                       /**< Shift value for MODEM_STEPSTATE             */
#define _MODEM_HADMCTRL1_STEPSTATE_MASK                         0x7UL                                                   /**< Bit mask for MODEM_STEPSTATE                */
#define _MODEM_HADMCTRL1_STEPSTATE_DEFAULT                      0x00000000UL                                            /**< Mode DEFAULT for MODEM_HADMCTRL1            */
#define _MODEM_HADMCTRL1_STEPSTATE_IDLE                         0x00000000UL                                            /**< Mode IDLE for MODEM_HADMCTRL1               */
#define _MODEM_HADMCTRL1_STEPSTATE_I_FREQ_COMP                  0x00000001UL                                            /**< Mode I_FREQ_COMP for MODEM_HADMCTRL1        */
#define _MODEM_HADMCTRL1_STEPSTATE_R_FREQ_COMP_FREQ_MEAS        0x00000002UL                                            /**< Mode R_FREQ_COMP_FREQ_MEAS for MODEM_HADMCTRL1*/
#define _MODEM_HADMCTRL1_STEPSTATE_I_PES                        0x00000003UL                                            /**< Mode I_PES for MODEM_HADMCTRL1              */
#define _MODEM_HADMCTRL1_STEPSTATE_R_PES                        0x00000004UL                                            /**< Mode R_PES for MODEM_HADMCTRL1              */
#define _MODEM_HADMCTRL1_STEPSTATE_R_PES_TES                    0x00000005UL                                            /**< Mode R_PES_TES for MODEM_HADMCTRL1          */
#define _MODEM_HADMCTRL1_STEPSTATE_R_TES                        0x00000006UL                                            /**< Mode R_TES for MODEM_HADMCTRL1              */
#define _MODEM_HADMCTRL1_STEPSTATE_I_TES                        0x00000007UL                                            /**< Mode I_TES for MODEM_HADMCTRL1              */
#define MODEM_HADMCTRL1_STEPSTATE_DEFAULT                       (_MODEM_HADMCTRL1_STEPSTATE_DEFAULT << 0)               /**< Shifted mode DEFAULT for MODEM_HADMCTRL1    */
#define MODEM_HADMCTRL1_STEPSTATE_IDLE                          (_MODEM_HADMCTRL1_STEPSTATE_IDLE << 0)                  /**< Shifted mode IDLE for MODEM_HADMCTRL1       */
#define MODEM_HADMCTRL1_STEPSTATE_I_FREQ_COMP                   (_MODEM_HADMCTRL1_STEPSTATE_I_FREQ_COMP << 0)           /**< Shifted mode I_FREQ_COMP for MODEM_HADMCTRL1*/
#define MODEM_HADMCTRL1_STEPSTATE_R_FREQ_COMP_FREQ_MEAS         (_MODEM_HADMCTRL1_STEPSTATE_R_FREQ_COMP_FREQ_MEAS << 0) /**< Shifted mode R_FREQ_COMP_FREQ_MEAS for MODEM_HADMCTRL1*/
#define MODEM_HADMCTRL1_STEPSTATE_I_PES                         (_MODEM_HADMCTRL1_STEPSTATE_I_PES << 0)                 /**< Shifted mode I_PES for MODEM_HADMCTRL1      */
#define MODEM_HADMCTRL1_STEPSTATE_R_PES                         (_MODEM_HADMCTRL1_STEPSTATE_R_PES << 0)                 /**< Shifted mode R_PES for MODEM_HADMCTRL1      */
#define MODEM_HADMCTRL1_STEPSTATE_R_PES_TES                     (_MODEM_HADMCTRL1_STEPSTATE_R_PES_TES << 0)             /**< Shifted mode R_PES_TES for MODEM_HADMCTRL1  */
#define MODEM_HADMCTRL1_STEPSTATE_R_TES                         (_MODEM_HADMCTRL1_STEPSTATE_R_TES << 0)                 /**< Shifted mode R_TES for MODEM_HADMCTRL1      */
#define MODEM_HADMCTRL1_STEPSTATE_I_TES                         (_MODEM_HADMCTRL1_STEPSTATE_I_TES << 0)                 /**< Shifted mode I_TES for MODEM_HADMCTRL1      */
#define _MODEM_HADMCTRL1_DFTSTARTOFF_SHIFT                      8                                                       /**< Shift value for MODEM_DFTSTARTOFF           */
#define _MODEM_HADMCTRL1_DFTSTARTOFF_MASK                       0x7F00UL                                                /**< Bit mask for MODEM_DFTSTARTOFF              */
#define _MODEM_HADMCTRL1_DFTSTARTOFF_DEFAULT                    0x00000000UL                                            /**< Mode DEFAULT for MODEM_HADMCTRL1            */
#define MODEM_HADMCTRL1_DFTSTARTOFF_DEFAULT                     (_MODEM_HADMCTRL1_DFTSTARTOFF_DEFAULT << 8)             /**< Shifted mode DEFAULT for MODEM_HADMCTRL1    */
#define _MODEM_HADMCTRL1_MAXSCHWIN_SHIFT                        15                                                      /**< Shift value for MODEM_MAXSCHWIN             */
#define _MODEM_HADMCTRL1_MAXSCHWIN_MASK                         0x78000UL                                               /**< Bit mask for MODEM_MAXSCHWIN                */
#define _MODEM_HADMCTRL1_MAXSCHWIN_DEFAULT                      0x00000008UL                                            /**< Mode DEFAULT for MODEM_HADMCTRL1            */
#define MODEM_HADMCTRL1_MAXSCHWIN_DEFAULT                       (_MODEM_HADMCTRL1_MAXSCHWIN_DEFAULT << 15)              /**< Shifted mode DEFAULT for MODEM_HADMCTRL1    */
#define _MODEM_HADMCTRL1_AVGSTARTOFF_SHIFT                      22                                                      /**< Shift value for MODEM_AVGSTARTOFF           */
#define _MODEM_HADMCTRL1_AVGSTARTOFF_MASK                       0xFFC00000UL                                            /**< Bit mask for MODEM_AVGSTARTOFF              */
#define _MODEM_HADMCTRL1_AVGSTARTOFF_DEFAULT                    0x00000000UL                                            /**< Mode DEFAULT for MODEM_HADMCTRL1            */
#define MODEM_HADMCTRL1_AVGSTARTOFF_DEFAULT                     (_MODEM_HADMCTRL1_AVGSTARTOFF_DEFAULT << 22)            /**< Shifted mode DEFAULT for MODEM_HADMCTRL1    */

/* Bit fields for MODEM HADMSTATUS0 */
#define _MODEM_HADMSTATUS0_RESETVALUE                           0x00000000UL                            /**< Default value for MODEM_HADMSTATUS0         */
#define _MODEM_HADMSTATUS0_MASK                                 0xFFFFFFFFUL                            /**< Mask for MODEM_HADMSTATUS0                  */
#define _MODEM_HADMSTATUS0_AVG0_SHIFT                           0                                       /**< Shift value for MODEM_AVG0                  */
#define _MODEM_HADMSTATUS0_AVG0_MASK                            0xFFFFUL                                /**< Bit mask for MODEM_AVG0                     */
#define _MODEM_HADMSTATUS0_AVG0_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_HADMSTATUS0          */
#define MODEM_HADMSTATUS0_AVG0_DEFAULT                          (_MODEM_HADMSTATUS0_AVG0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_HADMSTATUS0  */
#define _MODEM_HADMSTATUS0_AVG1_SHIFT                           16                                      /**< Shift value for MODEM_AVG1                  */
#define _MODEM_HADMSTATUS0_AVG1_MASK                            0xFFFF0000UL                            /**< Bit mask for MODEM_AVG1                     */
#define _MODEM_HADMSTATUS0_AVG1_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_HADMSTATUS0          */
#define MODEM_HADMSTATUS0_AVG1_DEFAULT                          (_MODEM_HADMSTATUS0_AVG1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS0  */

